{
  "title": "SO paper draft proofreading report",
  "cells": [
    {
      "type": "markdown",
      "data": "### Abstract\n\n* possible Oxford comma conflict in “goals of the experiment, motivate the design, and forecast its performance”\n* possible missing Oxford comma in list of frequencies (Sec. 9 uses the Oxford comma)\n* possible Oxford comma conflict in “…, …, and constrain the duration of reionization”\n* insert space in “2 $\\mu$K-arcmin”\n* possible Oxford comma conflict in “…, …, and the thermal and kinematic…”\n\n### Section 1\n\n* 6th paragraph: extra space in “60,000”; don’t use math mode\n* 7th paragraph: insert comma in “5,200” to comply with convention; don’t use math mode\n* last paragraph: italicize “_B_-modes”\n\n### Section 2\n\n* 1st paragraph: “Secs. 3–8” should use an en dash (-- in LaTeX) to demarcate a numerical range\n* Section 2.1, 1st paragraph: no hyphens in “6 m” and “0.5 m” unless “meter” is spelled out\n* ibid., last paragraph: missing reference\n* Section 2.2, 1st paragraph: missing comma, “sky cuts applied in, e.g.,”\n* Section 2.3, last paragraph: “Secs. 4–7” with an en dash\n* Section 2.4: italicize “B” in “*B*-modes”\n* Section 2.4.3: the second instance of “free–free” should use an en dash as well\n* Fig. 2, caption: missing period for abbreviation “Sec. 3”\n* Fig. 3, caption: “black body” should be one word, “blackbody” (and the same under heading “Standard”)\n\n### Section 3\n\n* Section 3.1, 1st paragraph: “/Mpc” or “Mpc^{-1}”?\n* Section 3.2, 1st paragraph: no spaces between numerical ranges, “0.01--0.1” and “70--90”\n* Section 3.4.2, 3rd-last paragraph: missing period “Fig. 9”\n\n### Section 4\n\n* 2nd paragraph: use semicolon to demarcate citation, “(…similar approach; Abazajian et al. 2016)”\n* Section 4.1.2, end of second paragraph: remove hyphen in “extra-galactic” since the rest of the paper uses “extragalactic”\n* Section 4.2, 1st paragraph: the inline equation should be on one line, i.e., $A_s (k/k_*)^{n_s-1}$\n* Fig. 17, caption: no need to hyphenate “foreground cleaning”\n* Fig. 24, caption: en dash in “dark matter--proton”\n\n### Section 5\n\n* Fig. 26, caption: put “MV” and “Pol only” in quotation marks to clarify they’re labels; should really be “Pol. only” since it’s an abbreviation, but the figure currently does not have it (and Fig. 27 would also have to change)\n* Fig. 27, caption: no hyphen needed in “foreground cleaning”\n* Fig. 28, caption: use en dashes for numerical ranges, no spaces in between (e.g., $0\\text{--}0.5$); just like in the text\n* ibid.: the _h_ in $k_\\text{max} = 0.3h \\,\\text{Mpc}^{-1}$ should stick with the number 0.3 rather than the unit\n* ibid.: say “29.4 and 66 arcmin^{-2}” instead\n* Fig. 30, caption: missing hyphen after “cross-” in “cross- and auto-correlations” and later, “cross-correlations”\n* First paragraph: pluralize “Secs. 5.1, 5.2…”\n* ibid.: could say “in Secs. 5.3 and 5.4, we…”\n* ibid.: use doubble quatation marks and put period inside them “delensing.”\n* Section 5.1, second-last paragraph: “multi-tracer”\n* Section 5.2, as a whole: possible to use “tSZ” and “kSZ” rather than “thermal SZ” and “kinematic SZ” since they were explained before\n* Section 5.2, 2nd paragraph: no hyphen needed in “foreground cleaning”\n* ibid., eq. 16: no period since the sentence continues\n* Section 5.2, 3rd paragraph: “40--400 GHz” with an en dash (numerical range)\n* ibid.: comma after “i.e.,”\n* Section 5.2, 4th paragraph: hyphenate “_E_-modes” (occurs twice in this paragraph)\n* ibid.: “kinematic SZ” rather than “kinetic”\n* ibid.: separate citation with semicolon, “Ferraro and Smith 2018; see Sec. 7.6 below”\n* ibid.: no hyphen after adverbs, “spatially averaged”\n* Section 5.3, 2nd-last paragraph: is there a reason why the power spectra $C^{\\kappa\\kappa}$ etc. don’t have subscripts ($L$)?\n* Section 5.3.1, 1st paragraph: missing period in “Sec. 5.3”\n* ibid.: no need for comma between “marginalizing over $\\Lambda$CDM parameters and including DESI BAO information.”\n* ibid., 2nd paragraph: hyphenate “percent-level”\n* ibid., eq. 19: no spaces between numerical ranges (e.g., $z = 1\\text{--}2$); need a comma and period after each line respectively\n* Section 5.3.2, last paragraph: as above, “$1\\text{--}2$”\n* ibid.: there’s no real need for putting parentheses around that sentence, plus they introduce nested parentheses for the citation\n* Section 5.3.3, 1st paragraph: can use en dash in “relying in most -- but not all -- cases”\n* ibid.: possible Oxford comma conflict “LSST, Euclid, and WFIRST” (occurs twice, then again in the next paragraph)\n* ibid.: hyphenate “meta-calibration”\n* ibid., last paragraph: italicize “_z_” in “photo-_z_”\n* Section 5.3.4, 1st paragraph: possible missing Oxford comma “non-linearities, baryons and galaxy bias”\n* ibid., 2nd paragraph: missing commas, “see, for example, recent…”; the years should also be in brackets since they are inside parentheses, “(… in Miyatake et al. [2017] and Singh et al. [2017])”\n* ibid.: possible Oxford comma conflict “matter density, curvature, and the equation of state…”\n* ibid., 3rd paragraph: render the algorithm name “redMaGiC” using a monospace font (occurs twice)\n* ibid., 4th paragraph: missing period in “Sec. 2”\n* ibid.: spell out “square degree” and “square arcminute”\n* ibid.: no need for parentheses in the last clause – just use a comma, “…0.1% (Sheldon and Huff 2017), although…”\n* ibid., 5th paragraph: too many “and”s in the last sentence; consider breaking into two sentences instead\n* Section 5.4, throughout: jumps between “thermal SZ effect” to “thermal Sunyaev–Zel’dovich effect” to just ”tSZ” (no “effect”) without warning (likewise for kSZ)\n* Section 5.4, first paragraph: no comma between “gravitation lensing and delensing”\n* ibid.: recommend a comma in “galaxy clusters and galaxies, and the bispectra…”\n* ibid., 2nd paragraph: use a colon to introduce a list “Several approaches exist…:”\n* ibid., under _Bias hardening_: “One can then project them out of lensing estimates **in** a process…”\n* ibid., under _Gradient cleaning_: missing commas “It is, however, sufficient…”\n* ibid., 2nd paragraph: italicize “TT”\n* ibid.: missing hyphen “tSZ- and CIB-deprojected”\n* ibid., under _Shear-only estimator_: possible missing Oxford comma, “tSZ, kSZ, CIB, and radio point sources”\n\n### Section 6\n\n* 1st paragraph: add comma, “tensor perturbations, and through…”\n* ibid.: possible Oxford comma conflict, “kinetic terms, … multiple fields, or through particle production”\n* 2nd paragraph: too many hyphens in “3- and-4-point [sic]”\n* ibid.: missing comma, “see, e.g.,”\n* ibid.: missing comma, “As mentioned in Sec. 5.3.2, an interesting…”\n* ibid.: are we treating “data” as singular or plural? I think it’s an uncountable noun so ”_Planck_ data has…” sounds better, but others might object; perhaps rephrase\n* 3rd paragraph: in the 1st inline equation, putting $f_\\text{NL}$, $f_\\text{NL}^\\text{Planck}$, and $f_\\text{NL}^\\text{SO}$ in parentheses will match the other paragraphs _and_ make the line look cleaner\n* ibid.: possible missing Oxford comma, “local, equilateral and orthogonal”\n* 4th paragraph: missing hyphen, “cross-correlation”\n* 5th paragraph: remove comma, “a growing body of work has explored…”\n* ibid.: hyphenate “higher-order”; and is it “massive-spin particles” or “massive spin-particles”?\n* 6th paragraph: no need to specify again that temperature is $T$, i.e., “we use temperature and _E_-mode polarization data”\n* ibid.: missing comma, “As an example, we…”\n* ibid.: possible Oxford comma conflict, “$\\langle BTT \\rangle$, $\\langle BTE \\rangle$, and $\\langle BEE \\rangle$”\n* ibid.: “the covariance **contains only** _B_-mode noise **and** no signal”\n* ibid.: missing comma, “… of $r$, constraints…”\n* ibid.: missing comma, “see, e.g.,”\n* Eq. 22: insert commas after each line?\n\n### Section 7\n\n* Fig. 36, caption: previous multi-panel figures have been using the convention “_Top:_ … _Bottom:_ …”\n* Fig. 37, caption: other figures were using “$1\\sigma$” rather than “$1\\text{-}\\sigma$”\n* ibid.: spell out “square degrees” (occurs twice)\n* ibid.: unclear “the best-case scenario where **know no** $\\tau_c$ perfectly”; perhaps “where we know…”?\n* ibid.: “solid line” rather than “full line”\n* ibid.: pluralize “dashed lines” and “solid lines”\n* Fig. 38, caption: no need for parentheses in “solid navy lines”\n* ibid.: convention in other sections was to use commas to demarcate variables, i.e., “IGM opacity, $\\lambda_\\text{mfp}$, and source efficiency, $\\zeta$”\n* ibid.: use semicolons to demarcate citations, i.e., “(green band; Planck Collaboration 2018d)” (occurs four times)\n* Fig. 39, vertical axis: spelling of “Ionization” vs “Ionisation”\n* Throughout: “kinematic” SZ rather than “kinetic” SZ\n* 1st paragraph: separate acronym “SZ” from citation using semicolon, i.e., “(SZ; Sunyaev and Zel’dovich 1969, 1972)”\n* 2nd paragraph: match the phrases “decrement at frequencies below 217 GHz and an increment at **frequences above**.”\n* ibid., after eq. 23: the symbol “=” does not replace the verb; rephrase sentence with, e.g., “Here, $x = h\\nu/(k_B T_\\text{CMB})$ is dimensionless, where…”\n* ibid.: also, a missing subscript on $k_B$ in the definition of $x$ since that is what’s written in the following text\n* ibid.: possible Oxford comma conflict, “$c$, $m_e$, and $\\sigma_T$” and “…, and Thomson cross-section…”\n* 3rd paragraph: “The **kinematic** SZ **effect** is…”\n* ibid.: possible spelling issue, “blackbody” rather than “black-body”\n* ibid.: delete space after dash and insert comma in “Eqs. 24--26, both…”\n* ibid.: no need to hyphenate “… momentum (kSZ) along the line of sight”\n* Section 7.1, 1st paragraph: choose either “microwaves to X-rays [plural]” or “microwave [singular] to X-ray energies”\n* Section 7.1, 4th paragraph: en dash in “tSZ--CIB”\n* ibid., 5th paragraph: commas in 16,000 and 24,000 to conform with earlier format; don’t use math mode\n* ibid.: no need to hyphenate “star formation”\n* ibid., 6th paragraph: comma before eq. 27\n* ibid., last paragraph: missing period in “Sec. 2”\n* Section 7.1.1, 1st paragraph: possible missing Oxford comma in “$w_0$, $w_a$ and $\\sum m_\\nu$”\n* ibid.: missing comma after first equation, and missing equation number?\n* ibid.: possible missing Oxford comma right after eq. 28, “with …, … and …”\n* Section 7.1.2: no space in numerical ranges, “$z = 1\\text{--}2$” and “$z = 2\\text{--}3$”\n* Section 7.2, under _Cosmological parameter forecast method_: use semicolons to demarcate the list elements, “$P_0$, which…; $\\beta_0$, which…; and $\\alpha_M$, which…”\n* ibid., 2nd paragraph: possible Oxford comma conflict, “AGN feedback, supernova feedback, and other…”; and again in the second-last sentence\n* ibid., 3rd paragraph: no need for comma in “nearby, massive clusters”\n* Section 7.2, under _Neutrino mass and dark energy_: for clarity, say “Table 7” rather than “The table”\n* Section 7.3, 1st paragraph: inconsistent punctuation in citation, should be ”(e.g., …; …; and references therein)”\n* ibid.: possible Oxford comma conflict in “star formation, supernovae, and active galactic nuclei,…”\n* ibid.: no need for hyphen in “star formation”\n* ibid., 4th paragraph: if writing “from” always use “to” rather than a dash, “from $z = 0.2$ to $0.8$”\n* ibid.: en dash in 50–100%\n* ibid., last paragraph: “demonstrated in Hill et al. (2016) **and** Ferraro et al. (2016), …”\n* Section 7.4, 1st paragraph: “**by** using … **[possible Oxford comma conflict],** or by using a **photometrically** selected…”\n* ibid., 2nd paragraph: too many commas lead to a choppy sentence; choose one comma and remove the other, “with hydrodynamical simulations, or estimation with complementary datasets, such as…”\n* ibid., 3rd paragraph: missing comma “nuisance parameters, $b_{\\tau_c}(z)$, …”\n* ibid.: missing space in “configurations. This…”\n* ibid.: missing hypen “$\\mu$K-arcmin”\n* Section 7.5, 1st paragraph: missing period in “Sec. 5.3.2”\n* ibid.: no comma needed in “such as the optical depth and electron pressure profile”\n* ibid., near end: capitalize “non-**G**aussianity on galaxy bias”\n* ibid., 3rd paragraph: use quotation marks in “LSST 3-year ‘gold’ sample”\n* Section 7.6, 1st paragraph: missing period in “Sec. 7.4”\n* ibid., under _kSZ amplitude parameter_, 2nd paragraph: use a semicolon to separate citation, “(Planck Collaboration 2016m; incorporated here…)”\n* ibid.: missing comma in “(following, e.g., …)”\n* ibid., under _Ionization effciency…_: the convention in other sections was to demarcate variables using commas, i.e., “ionization efficiency, $\\zeta$, and… ionizing photons, $\\lambda_\\text{mfp}$”\n* ibid.: simplify phrasing to “The spectra are simulated at discrete **steps** away from…”\n\n### Section 8\n\n* 1st paragraph: possible Oxford comma conflict in “AGN, DSFGs, and transient sources…”\n* ibid.: no hyphen in “afterglows”\n* ibid.: isn’t the abbreviated form of plural active galactic nuclei “AGNs”?\n* Section 8.1, title: as above\n* Section 8.1, 1st paragraph: I think “high-sensitivity” is better than “sensitive”\n* ibid.: possible Oxford comma conflict in “abundance, spectral energy distributions, and global polarization properties”\n* ibid., last paragraph: missing comma in “for example, in…”\n* Section 8.2, 1st paragraph: hyphenate “Follow-up”\n* ibid., last paragraph: no hyphen after adverb, “strongly lensed”\n* ibid.: extra spaces in “8,500–25,000”; don’t use math mode\n* ibid.: no spaces in numerical range, “18\\text{--}26”\n\n### Section 9\n\n* Fig. 40, caption: math mode “e” in “e-fold”\n* Table 9: footnote a, missing period to end abbreviation “s.f.”\n* ibid.: missing period to end footnote b\n* Table 10: no hyphen in “3 years of LSST”\n* Table 11: en dash in “DM--baryon interactions”\n* Section 9.1: for clarity, insert comma, “also for each case, **we** inflate…”\n* ibid., under _Tensor-to-scalar ratio_: italicize “_B_-modes”\n* ibid., under _Scalar perturbations_: put the parentheses ”($k = 0.2/\\text{Mpc}$)” at the end of the sentence\n* ibid.: convention up until now is to use “Mpc^{-1}” rather than “/Mpc”\n* ibid., under _Non-Gaussian perturbations_: missing spaces in “$\\sigma(f_\\text{NL}) = 2$”\n* ibid., under _Effective number of relativistic species_: use en dash for greater effect, “three neutrino species -- and no additional light species -- provides…”\n* ibid., under _Neutrino mass_: missing spaces in “$\\sigma(\\sum m_\\nu) = 0.04$”\n* ibid.: missing conjunction, “**and** (iii)”\n* ibid., under _Dark energy_: the other sub-subsections end their titles with a period, while this one does not\n* ibid.: no need for comma after “$z = 4$”\n* ibid.: no spaces in numerical range, “$z = 1\\text{--}2$”\n* ibid.: plural “Figs. 28 and 34”\n* ibid.: missing conjunction, “**and** (iii)”\n* ibid.: missing hyphen, “a half-percent measurement”\n* ibid., under _Galaxy evolution_: possible Oxford comma conflict, “massive galaxies, groups, and clusters”\n* ibid., under _Reionization_: possible Oxford comma conflict, “galaxies, quasars, and the intergalactic…”\n* Section 9.2, 1st paragraph: possible Oxford comma conflict in the list of frequencies\n* ibid.: match “arcminute” with “degree-scale”; use “-scale” or don’t\n* ibid., last paragraph: possible Oxford comma conflict\n* Section 9.3, 1st paragraph: too many “z”s in “summzarized [sic]”"
    }
  ]
}