{
  "title": "Actualité : Le changement d’heure a plus d’impacts négatifs que positifs selon les études",
  "cells": [
    {
      "type": "text",
      "data": "Laura Hubert"
    },
    {
      "type": "text",
      "data": "<div><b>LE CONTEXTE</b></div><div><br></div><div>Karima Delli était invitée sur <i>France Inter</i> le 16 février 2018, dans l’émission « Le Téléphone Sonne ». Le thème abordé portait sur le fait de remettre en cause ou non le changement d’heure. En effet, le 8 février 2018, le Parlement européen a adopté une résolution visant à mettre fin au changement d’heure partout en Europe. Il n’est pas encore question d’abandonner totalement ce système, mais des doutes subsistent sur l’utilité réelle du changement d’heure, qui a été adopté en 1976 pour faire des économies d’énergie. Durant l’émission, Karima Delli répondait à une auditrice, qui souhaitait une évaluation de l’impact du changement d’heure sur la santé : « <i>On demande à la Commission de renforcer les études, même si elle a déjà fait des études, où elle montre qu’il y a plus d’impacts négatifs – sur la santé, la sécurité routière, l’énergie – que d’effets positifs</i> ». Cependant, elle avoue elle-même que des études doivent être renforcées sur la question.</div><div></div>"
    },
    {
      "type": "text",
      "data": "<div><b>L’EXPLICATION</b><br></div><div><br></div><div>Les impacts positifs du changement d’heure porteraient tout d’abord sur l’économie d’énergie. Selon une étude de l’Agence de l’environnement et de la maîtrise de l’énergie (Ademe), les impacts actuels et futurs du régime d’heure d’été ressortent positifs sur le territoire français avec environ 44 kt (kilotonnes) d’émissions de CO2 évitées en 2009, avec une projection de 80 kt économisées en 2030. Mais, l’Ademe reconnaît que ces résultats obtenus sur une simulation sont à prendre avec précaution étant donné qu’il existe des incertitudes sur les évolutions de la demande en énergie au niveau national. De même, un Rapport du Sénat “Faut-il en finir avec l’heure d’été?” de Philippe François, datant de 1996, nuance cette économie d’énergie. Il fait remarquer que « <i>ces économies pourraient être illusoires car l’heure d’éclairage artificiel gagnée le soir serait largement compensée par les dépenses énergétiques supplémentaires induites le matin, en avril et septembre, pour l’éclairage et le chauffage</i> ». Une Étude du Parlement européen, de 2017, évoque un rapport de la Commission européenne de 1996 : celle-ci confirme que les économies réalisées sont assez marginales : 0,34% de l’énergie totale consommée a été économisée, entre 0,5% et 2,5% selon le pays, en fonction de la localisation géographique.</div><div><br></div><div>Autre argument en faveur du changement d’heure, dressé par la Commission européenne en 1996 : « <i>Les soirées plus claires favorisent la pratique d’activités physiques et sportives qui sont bénéfiques pour la santé quelle que soit la tranche d’âge de la population</i> ». Mais le rapport du Sénat de 1996 questionne cette affirmation : « <i>Si ce fait est avéré, il est étonnant de constater que cette faculté de loisirs supplémentaires est expliquée par le seul mécanisme horaire et ni par l’observation des conditions climatiques estivales qui facilitent les loisirs d’extérieur, ni par la coïncidence de la période des congés d’été qui favorise les sorties nocturnes.</i> » Une recherche portée par « Research voor Beleid International » en 1999, citée dans une Étude du Parlement européen confirme cette idée : « Dans le tourisme et le secteur des loisirs, il est quasiment impossible de faire des conclusions sur des évidences fortes. » Cette même recherche a observé des effets positifs et négatifs sur la santé. L’exposition au soleil augmente les activités à l’extérieur, mais trouble le biorythme du sommeil. Néanmoins, l’étude conclut que le corps s’ajuste au changement d’heure en plusieurs jours, avec un maximum de deux semaines; ainsi les effets négatifs disparaîtraient assez rapidement.</div><div><br></div><div>Mais ce changement d’heure semble également avoir de nombreux impacts négatifs. Un communiqué de presse du site de la Sécurité Routière indiquait en octobre 2016 que ces cinq dernières années le nombre d’accidents corporels des piétons en novembre est supérieur de 3,1% au mois d’octobre. Il est précisé également que pour la seule tranche horaire 17h-19h, cette augmentation est de 40%. Le recul d’une heure aurait une conséquence importante sur les heures d’éclairement : la nuit tombe alors plus tôt dans la journée, au moment de la sortie des classes ou des trajets de fin de journée professionnels.</div><div><br></div><div>Une audition publique européenne, menée en mars 2015 « Time to revisit summer time? », citée par une étude du Parlement européen, a couvert les aspects de la sécurité routière, de la santé et de l’énergie. Un expert de la sécurité routière se basait sur les données du Royaume-Uni pour montrer que des après-midi et soirées plus lumineuses diminuaient le risque d’accidents. Néanmoins, il disait que l’impact du changement d’heure divergeait selon le pays et sa localité. Les membres de cette audition publique ont statué que les études menaient à des conclusions contradictoires. L’expert de la sécurité routière a admis qu’il n’était pas toujours aisé d’établir une causalité aux accidents routiers, de prouver que c’est le changement d’heure qui provoque moins d’accidents, ou si c’est dû à des facteurs extérieurs.</div><div><br></div><div>Le rapport de la Commission Européenne, d’une étude du Parlement européen, conclut que les études n’ont pas trouvé d’indications que l’application du changement d’heure engendrerait de sérieux impacts, qu’ils soient positifs ou négatifs. C’est en cela que les propos de Karima Delli restent imprécis, elle-même soulignant le fait qu’il faudrait réaliser d’autres études sur le sujet.</div>"
    }
  ]
}