{
  "title": "Untitled Note",
  "cells": [
    {
      "type": "text",
      "data": "Okay, so how do you get polarization out of the CMB? The answer is Thomson scattering. Thomson scattering preferentially scatters into the plane perpendicular to the incoming electric field, so [write equation]. You can get this equation by differentiating the Larmor formula and dividing by the Poynting flux. But the point is, if you somehow set up a temperature quadrupole, say, with hot spots above and below and cold spots left and right, then the scattered photons are jiggled more in this direction than this direction, and that’s how you get them to be linearly polarized.<div><br></div><div>To descibe this polarization, the standard approach is to use the Stokes parameters I, Q, U, and V. [Write on board and descibe] Notice that when you flip the sign in temperature, so you flip the hot and cold spots, you also flip the sign of Q and U. What this creates is a <b>spin-2 field</b>, which was what I mentioned earlier. Basically this just means that the Q and U rotate into each other. For example, if I start with a polarization like this and define my coordinate axes like this, we say that it is a pure Q-field. Now if I rotate my coordinate axes, this thing now has Q and U components. This does not happen to temperature: if this point is 10 K, it’s 10 K no matter how I rotate my axes. This is because temperature is a scalar, or spin-0 field. Now, we want to work with spin-0 fields because they offer two distinct advantages: first, it is independent of coordinate system, so you don’t have to worry about different experiments using different coordinates; and second, the math is easier.</div><div><br></div><div>So let’s see what we can do with our spin-2 fields. We’ll start by writing out the spherical harmonic expansion [write out]. The 2s here means that they are spin-2 spherical harmonics, which are different from the ones we normally see. Now if I define these two objects like this… then the spin +2 and –2 coefficients combine to give you a spin-0 one, and we end up with two spin-0 fields E and B, which we can write in terms of the normal spherical harmonics.</div><div><br></div><div>The reason why they are called E and B are in analogy with E&amp;M, because as it turns out, the E field is curl-free and the B field is divergence-free. But I find the most natural way to understand them is in terms of their parity [show picture]. E fields don’t change by flipping left and right, so they have EVEN parity, whereas B fields do, so they have ODD parity. This is important because different polarization sources generate patterns that differ in parity.</div><div><br></div><div>Because polarization is a spin-2 object, it is described by a rank-2 tensor, which has the unique property that it can be decomposed into SVT components (you can’t do this for other ranks). So here are some things that can generate polarization: for scalars, we have the density perturbations; for vectors, we have vorticity in the cosmological fluid; and for tensors, we have gravitational waves.</div>"
    }
  ]
}