{
  "title": "Actualité : Ils s’en fichent…",
  "cells": [
    {
      "type": "text",
      "data": "<b>Atterré par le silence des commentateurs torontois au sujet de l’annulation du financement de la future université française à Toronto et de l’abolition du Commissariat aux services en français en Ontario, notre chroniqueur a choisi, exceptionnellement, de les interpeller en anglais. La version française suit.</b>"
    },
    {
      "type": "text",
      "data": "<div><b>COLUMN</b></div><h1><b>GUYS, REMEMBER PASTAGATE ? !</b></h1><div>La Presse columnist is aghast at the near-total lack of interest of the Toronto press</div><div>PATRICK LAGACÉ</div><div>LA PRESSE</div>"
    },
    {
      "type": "text",
      "data": "<div>Did you hear that double thud ? It’s the one-two punch that just landed on the face of the Franco-Ontarian community. The fist belongs to Ontario Premier Doug Ford, who has just cancelled plans to build the province’s first francophone university and eviscerated the Office of the French Language Services Commissioner.</div><div><br></div><div>Yes, I am outraged, as a lot of francophones from coast to coast are. Of course, to know about that outrage, you would have to check the French media. The anglo media outside Quebec are doing the bare minimum in terms of coverage.</div><div><br></div><div>Hence, this column in English. I’m thinking that maybe, just maybe, if you read about the outrage going on in your province from a guy in Montreal – but in English – maybe you’ll pay attention and start giving a damn. I’m not holding my breath, mind you.</div><div><br></div><div>The near-silence from the Toronto press on these bigoted cutbacks targeting the Franco-Ontarian community is quite ironic. Usually, outlets like the National Post, the Toronto Star or The Globe and Mail, to name a few, offer a pugnacious coverage of language issues and spats… when they happen in Quebec and when the (real or perceived) villain is the Quebec government.</div><div><br></div><div>But when francophobe cutbacks – yes, dear comrades in the Toronto commentariat, francophobe, say it, it won’t hurt your tongue – target the francophone minority in Ontario, the forceful columns and editorials are nowhere to be found.</div><div><br></div><div>It’s ironic, as I said, because through the years, I’ve sometimes had the impression, reading the Toronto press, that it is very, very, very concerned with the fate of minorities in Quebec. In fact, you could think, reading some pieces, that the anglo minority in Quebec is enslaved.</div><div><br></div><div>No, I am not conjuring up the slavery metaphor in vain. I actually read it in The Globe and Mail at the height of Pastagate… Remember Pastagate ? To recap : an inspector from the Office québécois de la langue française, in a ridiculous bout of zeal, was going to fine a restaurant for having Italian words on its menu. Granted, it was dumb. I said so at the time. So did many others in Quebec, in the winter of 2013.</div><div><br></div><div>Pastagate was heavily covered in the Toronto press. Columns, editorials : the hot takes were piling up. So, a piece published in the Globe on February 26th 2013 started with a lengthy quote from Frederick Douglass, the famous African-American former slave who fought against the infamy of slavery…</div><div><br></div><div>The second paragraph of the piece authored by Sandy White stated this : “That was Frederick Douglass writing about the fight against slavery in the United States prior to the American Civil War.</div><div><br></div><div>HOWEVER, ONE COULD EASILY MISTAKE THIS AS SOMEONE WRITING TODAY ABOUT QUEBEC…”</div><div><br></div><div>Caps are mine and serve to emphasize the sheer stupidity of linking the crimes against humanity that was slavery and the fate of the anglophone minority in Quebec. But it was written. And it was published. Not in a xenophobic rag like the Toronto SUN, mind you : in Canada’s National Newspaper.</div><div><br></div><div>Let’s stay on Pastagate, if you will. It is a great prism through which one can analyze the double standard at work when the media from English Canada step to the plate for the rights of linguistic minorities…</div><div><br></div><div>On March 1st 2013, at the height of Pastagate coverage, a National Post editorial stated this : “In short, Quebec’s language laws are an international embarrassment because they deserve to be – only they are really no laughing matter. CANADIANS WOULD BE APPALLED IF A FOREIGN GOVERNMENT IN A DEVELOPED COUNTRY TREATED A MINORITY THE WAY QUEBEC’S GOVERNMENT TREATS ITS ANGLOPHONES AND ALLOPHONES.”</div><div><br></div><div>Caps are mine, again…</div><div><br></div><div>I’ll be clear : there is always room for improvement in the treatment of Quebec minorities.</div><div><br></div><div>But inferring that anglophones and allophones in Quebec are so ill-treated that it should warrant international outrage is both incredibly dishonest and a gross exaggeration. Still, it was published.</div><div><br></div><div>As a Quebecker I am proud of the fact that the anglophone community has institutions that are publicly funded by the Quebec government. It has three universities, McGill, Concordia and Bishop’s. When Quebec built the francophone Centre hospitalier de l’Université de Montréal (CHUM), it also built the anglophone McGill University Health Center (MUHC), in the same spirit : that these hospitals be world-class hospitals. Nothing is perfect, of course, but this is one way to respect minorities : by funding their institutions.</div><div><br></div><div>So, tell me, fellow columnists in the Toronto papers, where is the world-class, francophone hospital in Ontario ?</div><div><br></div><div>There is Montfort, yes. Great hospital. Not “world-class” like the MUHC, I’d say, though. And the francophone community had to go to court a generation ago to ensure that the Conservative (again) government of Mike Harris could not kill Montfort Hospital, like it tried to.</div><div><br></div><div>And where is the francophone university in Ontario ? If you answered Ottawa U, wrong you are : it’s a bilingual university, like Laurentian in Sudbury. There was at long last going to be a francophone university in Toronto, after decades of dreaming about it and planning for it, and…</div><div><br></div><div>And, well, Doug Ford just killed it.</div><div><br></div><div>So I am asking you, my fellow comrades-in-arms in the commentariat, yes, you, the editorial and opinion writers based in Toronto…</div><div><br></div><div>Where is the outrage ?</div><div><br></div><div>Nowhere, I gather : Étienne Fortin-Gauthier, a reporter for the public broadcaster TFO, tweeted yesterday that his daily press brief from Queen’s Park included NOT A SINGLE WORD ABOUT THE FRANCOPHONES’ MOBILISATION (caps mine, again) in the Toronto press. Repeat : NOT A SINGLE WORD.</div><div><br></div><div>Francophones across Canada are aghast at this frontal attack on francophones’ institutions and rights led by Doug Ford and (sigh) Caroline Mulroney, who is exceptionally gifted in the role of the token francophone in Mr. Ford’s Cabinet. This outrage is echoed in Ottawa by Prime Minister Trudeau and Mélanie Joly, the Cabinet minister responsible for Official Languages. It is echoed by francophone media and the Montreal Gazette, which lambasted Ford in an editorial.</div><div><br></div><div>But what about the Toronto press, which is so influential in setting the agenda in this country ? All I’ve seen is a bare minimum coverage, a 5W-type coverage since the announcement last Thursday.</div><div><br></div><div>As far as I can tell, Chantal Hébert, in the Star, is the only opinion writer in the Toronto press who has given a voice to the grievances of French-speaking Ontarians.</div><div><br></div><div>Where are the pugnacious columns denouncing this mistreatment of a linguistic minority in Ontario ? Where are the sanctimonious editorials ? I am not even asking for a slavery metaphor ! You know, just the same concerns that propelled your Pastagate coverage from 2013…</div><div><br></div><div>I know that I’m gonna die waiting for you guys to care about francophones in Ontario. I have to come to terms with the fact that when it comes to linguistic minority rights, the Toronto press cares only about anglos in Quebec.</div><div><br></div><div>As for the Frogs in Ontario, well, as this delicious English expression goes : you don’t give a shit.</div>"
    },
    {
      "type": "text",
      "data": "<div><b>CHRONIQUE</b></div><h1><b>ILS S’EN FICHENT…</b></h1><div>PATRICK LAGACÉ</div><div>LA PRESSE</div>"
    },
    {
      "type": "text",
      "data": "<div>Il est vraiment ironique de constater le silence radio des médias anglophones hors Québec face à la double gifle que viennent de subir les Franco-Ontariens : le gouvernement de Doug Ford a pulvérisé d’un coup le financement de la future université française à Toronto et le Commissariat aux services en français.</div><div><br></div><div>Ironique, parce que des médias comme le National Post, le Toronto Star et le Globe and Mail n’ont fait qu’une couverture minimale de cette saloperie raciste.</div><div><br></div><div>Ironique, parce que ces journaux sont pourtant formidablement proactifs quand vient le temps de couvrir le sort des minorités au Québec, notamment la minorité anglophone.</div><div><br></div><div>Mais les compressions francophobes – dites ça, camarades producteurs d’opinions de Toronto : fran-co-pho-bes – de Doug Ford sont passées sous le radar de ces mêmes producteurs d’opinions.</div><div><br></div><div>Ne comptez pas sur les médias canadiens- anglais hors Québec (le Montreal Gazette l’a fait) pour s’indigner de ce qu’un gouvernement piétine les droits de sa minorité francophone. C’est ironique, comme je disais, parce que quand il est question de la minorité anglophone du Québec, là, les analystes patentés torontois montent au créneau avec force et avec zèle.</div><div><br></div><div>Quand on lit le National Post, le Globe and Mail et le Toronto Star, des fois (je parle de médias respectables, j’exclus donc ce torchon xénophobe qu’est le Toronto SUN), on peut avoir l’impression que la minorité anglophone du Québec est réduite à l’esclavage.</div><div><br></div><div>Non, je n’utilise pas l’image de l’esclavagisme à tort et à travers. Vous rappelez-vous le « Pastagate » ? C’est cette bêtise survenue il y a presque six ans, début 2013 : un inspecteur zélé de l’Office québécois de la langue française avait voulu sanctionner un restaurateur montréalais car des mots de son menu étaient en… italien.</div><div><br></div><div>L’affaire avait fait le tour du monde, et c’était bien fait pour l’OQLF. J’avais aussi raillé le zèle de l’OQLF.</div><div><br></div><div>Mais le 26 février 2013, une chronique publiée dans le Globe and Mail dans la foulée du « Pastagate » commençait avec une longue citation de Frederick Douglass, un Afro-Américain du XIXe siècle qui milita pour l’abolition de l’esclavagisme, après en avoir vécu les horreurs…</div><div><br></div><div>Puis, l’auteur de la chronique, Sandy White, a commencé sa chronique comme suit : « Douglass a écrit ces mots à propos de la guerre contre l’esclavagisme, avant la guerre civile. CEPENDANT, ON POURRAIT FACILEMENT ÉCRIRE CES MOTS À PROPOS DU QUÉBEC D’AUJOURD’HUI. »</div><div><br></div><div>C’est moi qui ai utilisé les majuscules, juste pour souligner la stupidité de faire un parallèle entre cette ignominie que fut l’esclavagisme des Afro-Américains aux États-Unis, dont les échos se font encore sentir de nos jours, avec le sort de la minorité anglophone du Québec, qui n’a – heureusement – jamais subi, de près ou de loin, les affres de l’esclavagisme.</div><div><br></div><div>Mais quand même, cette bêtise a été écrite, relue par un ou une « editor » qui n’a trouvé rien à redire et qui l’a publiée dans « Canada’s National Newspaper ». Probablement la même personne qui a publié un éditorial qui comparait le Cégep de Saint-Laurent aux talibans, dans un cas d’accommodement déraisonnable, en 2010…</div><div><br></div><div>Restons sur le Pastagate, prisme formidable et révélateur pour analyser l’indignation à géométrie variable de la presse torontoise quand il s’agit du sort des minorités. Ainsi, le 1er mars 2013, le National Post a publié un éditorial dont voici un extrait : « Le Québec mérite cet embarras international. LES CANADIENS SERAIENT SCANDALISÉS SI UN GOUVERNEMENT D’UN PAYS AVANCÉ TRAITAIT UNE MINORITÉ COMME LE QUÉBEC TRAITE SES ALLOPHONES ET SES ANGLOPHONES… »</div><div><br></div><div>(Les majuscules sont miennes, encore, pour marquer mon exaspération.)</div><div><br></div><div>Comprenez-moi bien : il y a toujours place à l’amélioration quant au traitement des minorités, au Québec et ailleurs dans le Canada.</div><div><br></div><div>Mais comparer le sort des anglos du Québec au sort de minorités qui provoquent des émois internationaux est malhonnête et exagéré.</div><div><br></div><div>Et je suis fier de ce fait comme Québécois : trois universités anglophones – McGill, Concordia et Bishop’s – sont financées par les deniers publics. Le CUSM anglophone a été bâti en même temps que le CHUM francophone, avec la même ambition : que ces hôpitaux soient des hôpitaux de calibre mondial. Bien traiter ses minorités, c’est bien financer leurs institutions.</div><div><br></div><div>Alors… Il est où, le grand hôpital de calibre mondial francophone en Ontario ? Nowhere. Il y a une génération de cela, il a fallu l’intervention des tribunaux pour sauver l’Hôpital Montfort d’Ottawa de la tentative d’assassinat des conservateurs (encore) de Mike Harris.</div><div><br></div><div>Il est où, le campus francophone en Ontario ? Non, l’Université d’Ottawa et l’Université Laurentienne ne comptent pas : ce sont des universités bilingues. L’université francophone ontarienne ne verra pas le jour car le gouvernement Ford en a torpillé le financement, la semaine passée.</div><div><br></div><div>Where is the outrage ? comme on dit à Toronto. Eh bien, nulle part. Les francophones de l’Ontario sont pourtant en pleine mobilisation. Leur indignation trouve des échos à Ottawa, où le premier ministre Trudeau et la ministre responsable des langues officielles, Mélanie Joly, ont dénoncé ces décisions. Cette indignation trouve des échos dans les communautés francophones ailleurs au Canada. Et dans les médias francophones.</div><div><br></div><div>Hier, le journaliste Étienne Fortin-Gauthier, de la chaîne publique ontarienne TFO, constatait ceci : PAS UN MOT SUR LA MOBILISATION DES FRANCOPHONES dans la presse torontoise. PAS UN.</div><div><br></div><div>(Les majuscules sont de moi, encore…)</div><div><br></div><div>Dans la presse torontoise, on a pu lire jusqu’ici le minimum syndical requis, une couverture factuelle, quelques lignes ici et là depuis l’annonce de jeudi dernier.</div><div><br></div><div>Je cherche les éditoriaux sur ces gifles à la minorité francophone ontarienne dans ces trois journaux de Toronto. Je cherche les chroniques. Je cherche une tonalité combative équivalente à celle qui teintait les opinions de ces médias dans « Pastagate »…</div><div><br></div><div>Pis je trouve pas.</div><div><br></div><div>Seule Chantal Hébert, dans le Toronto Star, y a consacré une chronique.</div><div><br></div><div>Je ne demande même pas aux commentateurs de médias canadiens-anglais hors Québec une métaphore liant le sort des Franco-Ontariens à celui des Afro-Américains qui ont vécu l’esclavagisme, ce serait exagéré.</div><div><br></div><div>Mais après des jours d’indignation face à la francophobie assumée de Doug Ford, sans dénonciations de médias torontois qui n’hésitent jamais à tomber dans l’exagération quand il s’agit de la minorité anglophone du Québec, il faut se rendre à l’évidence…</div><div><br></div><div>L’indignation de ces gens-là ne s’étend pas aux grenouilles.</div><div><br></div><div>Comment ils disent ça, déjà, en anglais ? Je cherche les mots exacts…</div><div><br></div><div>Ah, oui : they don’t give a shit.</div>"
    }
  ]
}