{
  "title": "Actualité : Somme : des lycéens refusent de lire le roman d’un écrivain franco-algérien",
  "cells": [
    {
      "type": "text",
      "data": "<div>Par Aude Bariéty</div>le 16 octobre 2018"
    },
    {
      "type": "text",
      "data": "<div><b>Fin septembre, l’écrivain franco-algérien Akli Tadjer a publié sur sa page Facebook le mail d’une enseignante qui racontait que ses élèves avaient refusé de lire des extraits d’un ouvrage de l’auteur. Une rencontre entre Akli Tadjer et ces lycéens est prévue en novembre.</b></div><div><br></div><div>«Il y a eu une levée de boucliers de certains élèves car l’auteur n’est pas Français (j’aimerais qu’ils écrivent le français comme vous…), l’histoire ne concerne pas la France (ils ne savaient pas que l’Algérie avait été française) et il y a du vocabulaire en arabe.» Le 24 septembre dernier, une professeur de Lettres-Histoire envoie ce mail à l’écrivain franco-algérien Akli Tadjer. Né à Paris en 1954, ce dernier est l’auteur d’une dizaine de romans dont Le Porteur de cartable, publié en 2002 aux éditions JC Lattès. L’ouvrage raconte la rencontre en 1962 à Paris de deux enfants, Raphaël, pied-noir, et Omar, fils d’immigré qui n’a jamais connu l’Algérie et soutien du FLN.</div><div><br></div><div>Dans son message, cette enseignante du lycée professionnel Pierre Mendès-France de Péronne (Somme) raconte les incidents qui ont eu lieu lorsqu’elle a décidé de faire lire des extraits du Porteur de cartable à ses élèves de première dans le cadre de la préparation d’une rencontre prévue le 16 novembre avec Akli Tadjer. Elle déplore «des réflexions vraiment racistes» et explique avoir dû «exclure» un élève parce qu’il avait refusé de prononcer le prénom «Messaoud». Trois jours plus tard, le 27 septembre, Akli Tadjer décide de publier ce mail sur sa page Facebook. «Pauvres profs de l’Éducation nationale», commente alors le romancier.</div><div><br></div><div>L’affaire suscite rapidement un important débat et Akli Tadjer reçoit de nombreux messages de soutien. «Que des élèves d’un lycée de la Somme refusent de lire un auteur au prétexte qu’il ne serait pas totalement français relève pour moi de la plus dangereuse des dérives. Honte à eux, à leurs parents, à tous ceux qui inoculent ce poison de l’intolérance débile», écrit l’écrivain Grégoire Delacourt dans un billet intitulé «Les loups sont entrés dans les écoles». «Quelle tristesse ce refus de lire Le Porteur de cartable. Ce boycott de l’écrivain […] à cause de son nom et de ceux de ses personnages est insupportable!» tweete le maire de Nice Christian Estrosi.</div><div><br></div><div><div><b>«On verra s’ils osent me lancer des insultes racistes»</b></div><div><br></div><div>Contacté par Le Figaro, le directeur académique des services de l’Éducation nationale de la Somme, Jean Hubac, reconnaît des «propos déplacés» mais juge «prématuré» de parler de «racisme» tant que les «quelques lycéens concernés» n’ont pas encore donné leur version des faits. Partis en stage depuis l’incident, ces derniers seront entendus après les vacances de la Toussaint. Quant à l’élève «qui s’est exprimé de la manière la plus répréhensible», il a «déjà été sanctionné en étant exclu du cours» et devrait écoper à son retour d’une sanction plus lourde, que Jean Hubac voudrait «éducative, pour le faire réfléchir».</div><div><br></div><div>«Une chose est sûre: certains élèves ont manqué à leurs devoirs de respect et de tolérance. Je comprends que l’enseignante ait été choquée, même s’il aurait mieux valu passer par la direction pour envisager ensemble des solutions plutôt qu’envoyer ce mail», affirme le directeur académique. Maintenue, la rencontre du 16 novembre avec Akli Tadjer se tiendra dans l’enceinte de l’établissement. Une cellule de l’académie d’Amiens a été «mobilisée» pour préparer ce rendez-vous et sera présente le jour J, annonce Jean Hubac, qui considère que l’incident de septembre a rendu cette rencontre «d’autant plus légitime».</div><div><br></div><div>De son côté, Akli Tadjer, que Le Figaro n’a pour l’instant pas réussi à joindre, s’est dit «consterné» par l’attitude des lycéens. «C’est la toute première fois que je vis une telle chose aussi violente en vingt ans d’écriture et de rencontres en milieu scolaire», a-t-il déclaré au Courrier picard. L’auteur semble en tout cas attendre avec impatience le mois de novembre. «On verra s’ils osent me lancer des insultes racistes», a-t-il lancé au Parisien sur un ton de défi. «À Péronne, ville marquée par la Première Guerre mondiale, j’ai envie de leur rappeler à quel point leur terre est gorgée du sang de Mohamed et de Messaoud. Ils sont venus mourir dans ces champs de betteraves, et on ne veut même plus prononcer leurs prénoms aujourd’hui. Je trouve ça très grave».</div></div>"
    }
  ]
}