{
  "title": "Actualité : Un pionnier de l’ADN perd des titres honorifiques pour des propos sur le QI des Noirs et des Blancs",
  "cells": [
    {
      "type": "text",
      "data": "14 janv. 2019, 16:32"
    },
    {
      "type": "text",
      "data": "<b>Après la diffusion d’un documentaire aux Etats-Unis, James Watson, pionnier de l’étude de l’ADN, a été déchu de ses titres honorifiques par un laboratoire qu’il a dirigé par le passé. Le scientifique avait déjà tenu des propos polémiques en 2007.</b>"
    },
    {
      "type": "text",
      "data": "Comme le rapporte la presse anglo-saxonne, le scientifique américain James Watson, lauréat du prix Nobel et co-découvreur de la structure de l’ADN, a été déchu de tous ses titres honorifiques du laboratoire de Cold Spring Harbor basé à New York, après avoir réitéré une analyse selon laquelle la génétique est un facteur explicatif d’une différence entre Noirs et Blancs dans les tests de QI, supposés quantifier l’intelligence.<div><br></div><div><div>Le scientifique avait jugé en 2007, auprès du Sunday Times, être «intrinsèquement pessimiste sur le futur de l’Afrique», dans la mesure où «toutes nos politiques sociales sont basées sur le fait que leur intelligence est la même que la nôtre, alors que tous les tests disent : pas vraiment». Il avait ajouté que, souhaitant que tous les Hommes fussent égaux, «les gens qui ont travaillé avec des employés noirs trouvent que cela n’est pas vrai». Il avait présenté par la suite ses excuses.</div><div><br></div><div>Toutefois, dans une interview réalisée l’été 2018 pour un documentaire diffusé par la chaîne américaine PBS le 2 janvier 2019, James Watson, âgé de 90 ans, a réaffirmé son analyse de 2007 : «J’aimerais avoir changé [d’avis], qu’il y ait de nouvelles connaissances qui affirment que la culture est plus importante que la nature, mais je n’ai vu aucune découverte de ce type. Et il y a une différence entre Noirs et Blancs dans les tests de QI. Je dirais que la différence existe, c’est génétique».</div><div><br></div><div>Le laboratoire de Cold Spring Harbor a fustigé James Watson, jugeant ses affirmations «non fondées», et annoncé avoir rompu tous liens avec le scientifique. «Les affirmations du docteur Watson sont répréhensibles et n’ont aucun fondement scientifique», a déploré dans un communiqué du 11 janvier le laboratoire que James Watson a dirigé par le passé (entre 1968 et 1993). Celui-ci a partagé le prix Nobel en 1962 avec Francis Crick et Maurice Wilkins pour la découverte en 1953 de la structure en double hélice de l’ADN.</div></div>"
    }
  ]
}