{
  "title": "Communication : Décision concernant le nom Redmen",
  "cells": [
    {
      "type": "text",
      "data": "<div>Chers membres de la communauté mcgilloise,</div><div><br></div><div>En janvier dernier, je m’étais engagée à statuer sur le maintien ou non de l’appellation Redmen d’ici la fin de la présente année universitaire. Je vous fais part aujourd’hui de ma décision sur cette question.</div><div><br></div><div>Au cours des derniers mois, j’ai eu l’occasion de prendre connaissance des différents points de vue formulés par les membres de notre communauté et d’approfondir la réflexion à ce sujet. J’ai entendu les opinions sincères et éclairées d’étudiants, de membres du personnel et du corps enseignant, et de diplômés, y compris des athlètes actuels, d’anciens athlètes et des membres des communautés autochtones. De nombreuses personnes m’ont fait parvenir leurs messages directement, alors que d’autres se sont adressées par écrit à des représentants de la haute direction de l’Université ou se sont exprimées notamment au moyen de lettres ouvertes, de votes et de pétitions. J’ai pris le temps de lire tous les messages, et je suis très reconnaissante aux centaines de McGillois et autres qui ont fait entendre leur voix.</div><div><br></div><div>En vue d’éclairer ma décision concernant l’appellation Redmen, j’ai également sollicité et pris en considération les conseils de membres de la communauté mcgilloise – notamment des étudiants et des membres du personnel et du corps enseignant – et ceux des principales parties prenantes, dont des membres des communautés autochtones et des diplômés.</div><div><br></div><div>J’ai étudié le rapport final du Groupe de travail sur les principes régissant la commémoration et les changements de nom, en accordant une attention soutenue aux principes et recommandations énoncés. De plus, j’ai consulté les coprésidents du Groupe de travail, les doyens Anja Geitmann et Robert Leckey, nommément au sujet du processus décisionnel relatif à l’appellation Redmen. Dans leur rapport, ils recommandent que les dossiers de commémoration et de changements de nom soient examinés par un comité indépendant. Dans le cas du nom Redmen, toutefois, les coprésidents m’ont conseillé de ne pas mettre sur pied un tel comité, compte tenu du degré élevé de participation de la communauté aux discussions organisées par leur groupe de travail et par celui du vice-principal exécutif sur les études et l’éducation autochtones, et des autres occasions offertes à la collectivité de se faire entendre sur cette question.</div><div><br></div><div>La liberté académique, l’intégrité, la responsabilité, l’équité et l’inclusion constituent les valeurs et les principes fondamentaux de notre institution. Ils nous définissent à titre de McGillois. C’est pourquoi ma décision sur le maintien ou le changement de l’appellation Redmen doit en être le reflet. La question du changement de nom de nos équipes sportives masculines a engendré un profond débat au sein de notre communauté. Dans ce contexte, je me suis rappelé les sages paroles du principal émérite Bernard Shapiro, qui, lors d’une récente conférence sur la liberté d’expression, faisait valoir que, dans un débat, « l’important n’est pas de gagner, mais d’apprendre ».</div><div><br></div><div>Ces derniers mois, j’ai pris conscience de l’immense fierté que ressentent nos étudiants-athlètes et nos diplômés face à la riche histoire et à la longue tradition de nos équipes sportives universitaires. Ces McGillois ont retiré une grande satisfaction de leur passage au sein de leur équipe sportive, où ils ont cultivé des valeurs telles la loyauté, la résilience, le leadership, le travail d’équipe et l’amitié. Bon nombre d’entre eux ressentent un profond attachement à l’égard du nom de l’équipe. Nos étudiants-athlètes et diplômés sont, à juste titre, fiers d’avoir su exceller aussi bien dans leurs études que dans leur sport.</div><div><br></div><div>D’autre part, j’ai également pu mesurer toute la douleur causée par le nom Redmen. Des étudiants autochtones de McGill m’ont confié que ce nom leur procurait un sentiment d’exclusion. Ils se sentent méprisés et laissés pour compte. Ils vivent un conflit intérieur entre leur fierté légitime d’appartenir à un peuple autochtone et celle d’être des étudiants mcgillois. Et cette tension est encore plus forte chez les étudiants-athlètes autochtones.</div><div><br></div><div>Ces sentiments émanent d’expériences vécues. Ces sentiments sont forts, valables et bien réels.</div><div><br></div><div>Aucune langue, ni d’ailleurs son interprétation, n’est figée dans le temps. La langue évolue au même rythme que le monde. Certes, McGill n’a pas adopté l’appellation Redmen en référence aux peuples autochtones d’Amérique du Nord, mais, à différents moments de notre histoire, ce nom a déjà été associé aux peuples autochtones. De nos jours, « Redmen » est largement reconnu comme un terme offensant pour désigner les peuples autochtones, comme en font foi les principaux dictionnaires de langue anglaise. Bien que la connotation péjorative de ce nom ne reflète aucunement la conception des nombreuses générations d’athlètes qui ont fièrement défendu les couleurs de l’Université McGill, nous ne pouvons faire fi du sens qui lui est attribué aujourd’hui. Les intentions, si louables soient-elles, ne compensent pas les effets préjudiciables causés par l’appellation Redmen. L’inclusion et le respect sont au cœur des valeurs et des principes de l’Université, alors que les épithètes péjoratives, elles, sont contraires à l’identité même de notre communauté.</div><div><br></div><div>Pour ces raisons, il est clair que « Redmen » n’est pas le nom que nous choisirions aujourd’hui, ni celui que devrait conserver McGill à l’aube de son troisième siècle d’existence.</div><div><br></div><div>Je vous annonce donc qu’à compter d’aujourd’hui, les équipes sportives universitaires masculines de McGill ne porteront plus le nom Redmen. À cet effet, j’ai demandé au Pr Fabrice Labeau, premier vice-principal exécutif adjoint par intérim, Études et vie étudiante, de mettre sur pied un comité directeur chargé de mener, auprès de nos athlètes universitaires et de l’ensemble de la communauté mcgilloise, un processus consultatif visant le choix d’un nouveau nom que tous pourront porter – et célébrer – avec fierté. De plus amples renseignements au sujet de cette consultation vous seront communiqués dans les mois à venir. Notre communauté aura besoin de temps pour choisir un nouveau nom qui saura rendre hommage à la riche histoire sportive de McGill, mais nous y parviendrons. Dans l’intervalle, pour la saison 2019-2020, nos équipes sportives masculines porteront le nom McGill. L’Université annoncera la nouvelle appellation de ses équipes masculines à temps pour le début de la saison 2020-2021.</div><div><br></div><div>Tout comme le monde change, la communauté mcgilloise grandit et évolue, mais sans pour autant effacer le passé. Notre communauté est fière de sa longue tradition d’excellence sportive, et elle le sera toujours. Cette histoire est bien vivante, et de nouveaux chapitres glorieux s’écriront encore au fil des années à venir. Ensemble, guidés par notre engagement commun à favoriser l’égalité, l’inclusion et le respect, nous continuerons de tracer notre chemin.</div><div><br></div><div>Cordialement,</div><div><br></div><div>Suzanne Fortier</div><div><br></div><div>Principale et vice-chancelière</div>"
    },
    {
      "type": "text",
      "data": "Source :&nbsp;<a href=\"https://mcgill.ca/principal/fr/communications/enonces/decision-concernant-le-nom-redmen\">https://mcgill.ca/principal/fr/communications/enonces/decision-concernant-le-nom-redmen</a>"
    }
  ]
}