{
  "title": "Thesis proposal items",
  "cells": [
    {
      "type": "markdown",
      "data": "### Jason Leung – January 11, 2019\n\nThis is a preliminary document outlining the major components of my thesis project. **N.B.:** This is not the proposal itself!"
    },
    {
      "type": "markdown",
      "data": "# Basic timeline\n\n*(Boldface items are described in more detail in subsequent sections, and will form the cornerpieces of my thesis)*\n\n## Hardware\n\n**Gondola integration:** May–August 2019\n\n*In transit:* August–October 2019\n\n**SPIDER-II deployment:** November 2019 – February 2020\n\n## Analysis\n\n**SPIDER–_Planck_ joint analysis:** ongoing, until April 2019\n\n**SPIDER-II pointing solution:** March-September 2020\n\n*Preliminary maps and detector characterization:* October 2020 – March 2021\n\n*Null tests and foreground removal:* April–October 2021"
    },
    {
      "type": "markdown",
      "data": "# SPIDER–_Planck_ joint analysis\n\nThe first SPIDER flight took place in 2015 and returned data of the cosmic microwave background (CMB) in the 95 and 150 GHz bands. The team is presently in the final stages of data analysis. It was discovered relatively early on that SPIDER’s scan-synchronous noise limits its ability to discern large-scale features (low-$\\ell$ regime). We devised a method to recover the low-$\\ell$ information using _Planck_ legacy data. This is joined with SPIDER’s high-$\\ell$ information to obtain a map combining the best of both experiments. We expect that this technique could be repeated with SPIDER-II data."
    },
    {
      "type": "markdown",
      "data": "# SPIDER-II gondola integration\n\nAlthough the SPIDER-II gondola and its various subsystems have largely been designed before I joined the project four months ago, a recent turnover in personnel means there is no shortage of work. Gondola integration is not only an excellent way of learning how all the subsystems fit together, but forms the basis on which post-flight analysis is built (e.g., where did a particular timestream come from and what does it mean?).\n\nBelow are the hardware components which need to be integrated – i.e., assembled, tested, and characterized – before SPIDER-II can be declared “flight-ready.”\n\n_(in alphabetical order)_\n\n#### Antennae\n\nThe communication system with the gondola relies on a set of antennae, which need to be mounted and tested. The mounts are in being designed at present, as they need to comply with CSBF regulations.\n\n#### Magnetometer\n\nOne of the systems used to determine gondola orientation. Feeding the GPS location and altitude into the NRAO’s World Magentic Model, the magnetic field reading will determine the orientation of the gondola.\n\nGondola orientation is an essential measure as the telescope *must* remain shielded from the sun.\n\n#### Software patches\n\nDespite the number of tests executed, it is a given that a software bug won’t be caught before flight. Sometimes, this will be a flight-critical bug that, unless patched, will jeopardize the whole project. Designing and deploying in-flight patches is an intricate dance well worth practicing while still on the ground.\n\n#### Solar panel and sunshield bracing\n\nThe solar panels and sunshield are enormous flat pieces, making them prone to “flapping.” Based on experience from prior flights, additional support bracing for the solar panels and sunshield will be needed. But because assembly of the gondola superstructure is done by hand, the final result will never be exactly as the model predicts, making it impossible to determine beforehand what the bracing will look like. A solution needs to be found in the time after completing assembly but before flight.\n\n#### Star camera testing\n\nThe star cameras are used to determine the approximate pointing of the telescope boresight. Using the stars seen in the field of view, this subsystem taps into a astrometry database to solve for the location on the celestial sphere.\n\n#### Sun sensor testing\n\nAnother system used to determine gondola orientation. Given a time and location, the position of the sun determines the orientation. Useful because of 24-hour sunlight during the Antarctic summer.\n\n#### Thermal analysis\n\nThe gondola will experience a wide range of environmental conditions from launch to float, with the biggest problem being thermal in nature – all parts, whether mechanical or electronic, have a temperature range beyond which they will fail. Thermal modeling using Thermal Desktop software is done by another student, and the recommendations will need to be implemented.\n\n#### Thermal–vacuum testing\n\nThe gondola will be operating in the upper stratosphere at an altitude of 35–50 km. We need to ensure that the instruments will work in such environments, so the easiest test is to operate them within a thermal–vacuum chamber.\n\n#### Thermometry system\n\nTo aid in-flight temperature control, I’ve designed and prototyped an Arduino-based thermometry system. After the details are finalized by another student, we will need to integrate it into the whole SPIDER ecosystem."
    },
    {
      "type": "markdown",
      "data": "# SPIDER-II deployment\n\nFinal integration of the SPIDER-II gondola will happen as soon as the team arrives at McMurdo Station in late 2019. This process involves assembly, balancing, connecting to the flight power system (solar panels), testing for electric insulation, and “scan testing” (a dry run by hanging the gondola from a crane)."
    },
    {
      "type": "markdown",
      "data": "# SPIDER-II pointing solution\n\nThis is a large part of the section of analysis called the **flight performance characterization**, without which the science analysis cannot proceed. In order for the collected timestreams to mean something, we need to first determine where the telescope was pointed at every moment. This information will come from the various pointing systems, but one needs first to determine their systematics, account for any drift, and apply the appropriate geometric transformations to recover the telescope pointing. The results from each independent pointing system can then be compared to ensure consistency as well as provide a measure of uncertainty. This is a time-consuming process that is expected to take at least six months in the most ideal situation (estimate based on past flights)."
    }
  ]
}