{
  "title": "Thesis qual practice questions",
  "cells": [
    {
      "type": "markdown",
      "data": "## SPIDER Questions\n\n1. Why has Spider been designed to have the resolution it has?\n2. What about the design of Spider sets this resolution? What is the equation for the resolution of a “diffraction limited telescope.” If you apply this equation to Spider’s lenses, do you get this resolution? Explain.\n3. Related: How large are Spider’s sidelobes? What sets the amplitude of these sidelobes? Could Spider’s resolution be increased at the expense of larger sidelobes? How do the baffles fit into all of this?\n4. Why does Spider care how large the sidelobes are?\n5. Sketch the spider optics. Where are there filters? What do they do?\n6. Describe the focal plane arrays. What do the various parts do? Consider these goals: ‘appropriate’ ‘illumination’ of the optics, band-pass, polarization sensitivity, detection of mm-wave light (how does a TES work?).\n7. If there were filters in the optical chain of Spider, how much optical loading would there be? What would this do to the hold time of the cryostat?\n8. What sets the final bandpass of a Spider channel? Why were the Spider bands chosen to be what they are?\n9. Discuss reaction-wheel tradeoffs: a) What determines the required torque of the reaction wheel motor? b) What determines the required maximum rotation speed for the motor? c) How would changing brick mass change anything? d) How would changing spoke length change anything?\n10. How do the requirements of BIT differ from the requirements of Spider?\n11. What role does the pivot play? What sets the required torque for the Spider pivot?\n12. The BIT gondola is built much differently than Spider. Why? When is a CF tube gondola preferred? When is an Al honeycomb gondola preferred?\n13. What sets the desired sample rate for: gyroscopes, current monitors, thermometers?\n14. Explain ‘aliasing’ in an A/D converter, and explain the purpose of an anti-aliasing filter. What sets the desired bandpass of the anti-aliasing filter?\n15. Sketch out a solar power system and explain the parts. What sets the desired size of a solar array? Of a battery?\n16. What properties are desirable for the sun-facing side of a gondola. Why? What are examples of materials with these properties?\n17. Sketch out how the Spider cryostat works. What are the various stages? What are they for?\n18. What are the temperatures of the various parts of the optical chain for Spider. Why are they this temperature?"
    },
    {
      "type": "markdown",
      "data": "## Science Questions\n\n1. At high galactic latitudes ($b > 30$) what are the dominant sources of $\\langle TT\\rangle$ signal at $\\ell \\approx 80$ at the following frequencies: 5 GHz, 25 GHz, 150 GHz, and 350 GHz\n2. How about for $\\langle EE\\rangle$ signals?\n3. How about for $\\langle BB\\rangle$ signals?\n4. Sketch the $\\langle BB\\rangle$ spectrum for synchrotron, CMB with $r = 0.1$, and dust at high galactic latitude. Include axes and rough numerical values.\n5. What is the functional form for a single temperature dust foreground?\n6. What would happen to the dust spectrum if there were several dust components at different temperatures along the line of sight?\n7. What is the temperature of high latitude galactic dust? At what frequency does it peak?\n8. What do “optically thick” and “optically thin” mean? For frequencies relevant to the CMB, are the high galactic latitude foregrounds optically thick or optically thin?\n9. What are sizes of: the solar system; the Milky Way; the distance to the Andromeda Galaxy; voids in the cosmic web?\n10. What is the science goal of Spider, and why is it the right instrument? In answering this, justify: the observing frequencies, the location (balloon over Antarctica), the aperture size, having a waveplate, having a cryostat, and the observing strategy\n11. Compare/contrast the above with: BICEP II/Keck, Advanced ACTpol, SPT pol, and _Planck_"
    }
  ]
}