{
  "title": "Actualité : Une Montréalaise arrêtée en Floride après avoir blagué à propos d'un bombe dans un avion",
  "cells": [
    {
      "type": "text",
      "data": "<b>Une Montréalaise a été arrêtée mardi soir après avoir blagué sur le fait qu’elle transportait une bombe dans son bagage à main dans un avion en partance de l’aéroport de Fort Lauderdale, en Floride. Sa plaisanterie lui a même valu un passage devant le juge et une forte amende.</b>"
    },
    {
      "type": "text",
      "data": "<div>Un agent de bord s’est adressé aux passagers qui possédaient des bagages trop gros pour être placés dans les compartiments en cabine, rapporte le quotidien local «Sun Sentinel».</div><div><br></div><div>Nathalie Tremblay, 53 ans, aurait alors dit à son conjoint: «il y a une bombe dedans» et aurait ensuite éclaté de rire.</div><div><br></div><div>Son conjoint l’a averti de ne pas faire de blague à ce sujet, mais l’agent de bord a été dérangé par le commentaire. Après en avoir discuté avec le pilote, les passagers ont dû descendre de l’appareil.</div><div><br></div><div>Le terminal 2 a été fermé pendant que l’escouade de déminage du bureau du shérif du comté de Broward a examiné le bagage, qui ne contenait finalement pas d’explosif.</div><div><br></div><div><div>L’intervention a causé un délai d’environ deux heures pour ce vol d’Air Canada, mais aussi des retards d’une heure pour deux autres vols au même terminal.</div><div><br></div><div>Interrogée par les policiers, Mme Tremblay aurait changé ses versions à plusieurs reprises. Elle aurait d’abord affirmé aux agents qu’elle avait plutôt dit de manière sérieuse: «J’espère qu’il n’y a pas de bombe là-dedans», rapporte toujours le «Sun Sentinel».</div><div><br></div><div>Elle a ensuite admis avoir faire «une blague stupide» à propos de son sac, en disant à l’agent de bord que «c’était probablement une bombe».</div><div><br></div><div>Les policiers ont arrêté Mme Tremblay, qui a comparu devant un juge mercredi. «Je crois qu’il s’agit d’une horrible blague qui a vraiment mal tourné et je crois que Mme Tremblay réalise ça maintenant», a affirmé Hector Romero, l’assistant du défenseur public.</div><div><br></div><div>La juge du comté de Broward Jackie Powell a fixé à 5000 $ US la caution de l’accusée, soit environ 6645 $ CAN.</div></div>"
    }
  ]
}