{
  "title": "Addendum from Dick (email Mar 20)",
  "cells": [
    {
      "type": "markdown",
      "data": "good start re inflation.\n\nto add to your understanding and hopefully not mystification, here is a better way to think of this that is more general.\n\nyou were in the slow-roll limit where $\\ddot{\\phi}$ is neglected, hence $3H\\dot{\\phi} = -\\mathrm{d}V/\\mathrm{d}\\phi$. in that case the acceleration parameter $\\epsilon = -\\mathrm{d}\\ln H/\\mathrm{d} \\ln a$ is near zero.\n\nwhat a former grad student **Dave Salopek** and i showed in the late 80s (that everyone adopted) is that there is a better way of thinking about it, the Hamilton–Jacobi picture of inflation\nthe hubble parameter turns out to be attracted to a function only of the scalar fields $H(\\phi)$, and the various field momenta $P_{i,\\phi} = \\mathrm{d}\\phi/\\mathrm{d}t$ are given by aka attracted to $- 2M_\\mathrm{Pl}^2 \\,\\mathrm{d}H/\\mathrm{d}\\phi$\n\n> What does “attracted” mean here?\n\nthe slow-roll parameter is $\\epsilon = 2M_\\mathrm{Pl}^2 (\\mathrm{d}\\ln H/\\mathrm{d}\\phi)^2$ and $H$ obeys the Hamilton–Jacobi energy constraint equation, aka the energy constraint equation, aka the $G_{00}$ Einstein equation,\n\\begin{equation}\nH^2 = \\frac{8\\pi G}{3} \\left( \\frac{1}{2}P_{i,\\phi}^2 + V\\right),\n\\end{equation}with $P_{i,\\phi} = - 2M_\\mathrm{Pl}^2 \\,\\mathrm{d}H/\\mathrm{d}\\phi$ substituted. this is also what is done in classical dynamics, with momentum $p_i = \\mathrm{d}S/\\mathrm{d}x^i$. $H(\\phi)$ is a reduced action, also called Hamilton’s principal function $S$.\n\n> Without getting too deeply into the matter, this is just saying that we can make the analogy $x \\rightarrow \\phi$ and $\\mathrm{d}S/\\mathrm{d}x^i \\rightarrow \\mathrm{d}H/\\mathrm{d}\\phi$ up to a constant. Recall that the Hamiltonian $\\mathscr{H} = T+V$ in classical mechanics.\n\n> I’m not too caught up on the Hamilton–Jacobi energy constraint equation though. **Need to look this up.**\n\nthese equations do not require that $\\epsilon$ be small, just $<1$ (ie the universe is accelerating)\n\ntrajectories $\\phi(x,t)$ which do not have new sources of fluctuations obey this equation\n\\begin{equation}\n\\mathrm{d}\\phi =  -2M_\\text{Pl}^2 \\left(\\frac{\\mathrm{d}\\ln H}{\\mathrm{d}\\phi}\\right) \\mathrm{d} \\ln a\n\\end{equation}with $\\ln a$ the time variable. this is the drift term, it is a classical force evolution of $\\phi$.\n\n> Wait, why are the fields trajectories? I think this has to do with the analogy $x \\rightarrow \\phi$, $t \\rightarrow \\ln a$. Not too certain about the force part either.\n\n> This equation comes from the field momentum defined earlier\n> \\begin{align}\n> \\frac{\\mathrm{d}\\phi}{\\mathrm{d}\\ln a} &= \\frac{-2M_\\mathrm{Pl}^2 (\\mathrm{d}H/\\mathrm{d}\\phi)}{H} = \\frac{P_{i,\\phi}}{H} \\\\\n> \\frac{\\mathrm{d}\\phi}{\\mathrm{d}\\ln a} &= \\frac{1}{H} \\frac{\\mathrm{d}\\phi}{\\mathrm{d} t} \\\\\n> \\mathrm{d}\\ln a &= H \\,\\mathrm{d}t \\\\\n> a &= \\exp(Ht)\n> \\end{align} so we have an inflating universe.\n\n> $\\ln a$ is the time variable because of exponential expansion.\n\nin stochastic inflation, there is a fluctuation kick term which feeds this: in time interval $\\mathrm{d}\\ln a$, the kick is $\\delta \\phi = H/2\\pi \\times \\text{Gaussian random deviate} \\times \\sqrt{\\mathrm{d}\\ln a}$ from quantum fluctuations that freeze out into the coarse-grain field $\\phi$ is added to the drift term $-2M_\\mathrm{Pl}^2 \\left(\\mathrm{d}\\ln H/\\mathrm{d}\\phi\\right) \\mathrm{d} \\ln a$.\n\nie stochastic equation is\n\\begin{equation}\nd\\phi = -2M_\\mathrm{Pl}^2 \\left(\\frac{\\mathrm{d}\\ln H}{d\\phi}\\right) \\mathrm{d}\\ln a + \\frac{H}{2\\pi} \\times \\text{Gaussian random deviate} \\times \\sqrt{\\mathrm{d}\\ln a}\n\\end{equation} – actual stochastic equation system is a little more general, allowing for kicks off the attractor, but this gives the essence\n\n> Where does the $H/2\\pi$ come from? And why is there a square root in $\\sqrt{\\mathrm{d}\\ln a}$: do the units work out?\n\n> What is the difference between a drift and a kick if they’re both deviations? (deviations from what?) My guess: drifts come from the “natural” evolution of $\\phi$, while kicks come from stochastic processes. But then why is the whole thing called the _stochastic equation_?\n\nrelation to $\\zeta$:\n\nwhat is amazing is that you can sum over all $\\mathrm{d}\\phi$ to get $\\mathrm{d}\\zeta$, which has an important property – **it is conserved in the absence of kicks.** ie over the same interval of $\\mathrm{d}\\ln a$, $\\zeta$ has no drift just the kicks $\\delta \\zeta$, obeying\n\\begin{equation}\n\\mathrm{d} \\zeta = \\sqrt{P_\\zeta\\,\\mathrm{d}\\ln (Ha)} \\times \\text{Gaussian random deviate}\n\\end{equation} ie as resolution aka wavenumber $k \\sim Ha$ (horizon scale) goes from low $k$ to high $k$, $\\zeta$ trajectories follow a random walk in $\\ln k$:\n\\begin{equation}\n\\langle \\mathrm{d}\\zeta \\,\\mathrm{d}\\zeta \\rangle = P_\\zeta \\,\\mathrm{d}\\ln k \\;\\delta_{ k,  k’}.\n\\end{equation} \n\n> **Still not too sure about the whole trajectories thing.** Saw this earlier with the fields $\\phi$ as well.\n\n> I could sort of intuit the first equation: since $P_\\zeta$ is the power spectrum while $\\mathrm{d}(Ha) \\sim \\mathrm{d}\\ln k$ is the scale, multiply them to get an power at a certain scale. This multiplication in wave-space would be a convolution in real space. The square root still bugs me though – I guess it’s an amplitude rather than power?\n\n> Not too sure how to connect the second equation to a random walk. The second equation comes from two copies of the first.\n\n> The whole point of the above was just that $\\mathrm{d}\\zeta = \\text{drift} + \\text{kicks} = 0 + \\text{kicks}$. Not sure why drift = 0 though.\n\nthis is the story of $\\zeta$, and why it is so important and useful. it is conserved (adiabatic) in the absence of fluctuation kicks coming across the (instantaneous horizon) and remains constant through all of the subsequent evolution in preheating, heating, transmutation of species from one form to another, setting up the initial conditions for the density perturbations in photons, baryons, CDM, neutrinos that we evolve from outside the horizon to inside to get the response of the observable CMB and LSS signals to the random field $\\zeta$ that was laid down from stochastic (quantum) fluctuations during inflation.\n\nwhy learning about $\\zeta$ from the data is worth the effort.\n\n> Are you saying that $\\zeta$ allows us to probe outside the horizon? I’m having trouble following how $\\zeta$ being constant is an interesting thing."
    },
    {
      "type": "markdown",
      "data": "## Reply March 21\n\nglad you replied and to see you are making an effort to comprehend my (terse) emails.\n\nin the hamilton jacobi equation (aka the friedman equation) the $P_i^2/3$ should have been $P_i^2/2$, the kinetic energy density term (which combines with the $V$).\n\n> Corrected. Now it makes more sense since kinetic energy is $P^2/2m$.\n\nthe $\\sqrt{\\mathrm{d}\\ln k}$ is there because apart from the drift the field $\\phi$ follows a random walk, ie a diffusion, which means the correlation (separation) between field values (a quadratic) grows like Time.\n\nie the stochastic description is that the field $\\phi$ at a point $x$ has a drift/classical force and a diffusion. the diffusion per $\\mathrm{d}\\ln a$ goes like the square of the Hawking temperature $(H/2\\pi)^2$. this is the power spectrum per $\\mathrm{d}\\ln k$ of the field fluctuations.\n\n$\\zeta$ gets kicked by the stochastic terms but has no drift. so once the kicks stop it is frozen in.\n\nas the U evolves what was outside the instantaneous horizon comes into causal contact again. $Ha$ grows until preheating begins (at $\\epsilon = 1$) and then declines. it sets the scale for the comoving horizon. $Ha\\sim a^{(1-\\epsilon)}$, increasing for $\\epsilon <1$, decreasing for $\\epsilon = 1$. for radiation domination $\\epsilon = 2$. for cold dark matter domination $\\epsilon = 3/2$. the inflation story is all about breaking away from pure deSitter space ($\\epsilon = 0$) to have $\\epsilon$ dropping during inflation towards ultimately $\\epsilon = 1$ when the fields start to oscillate and create fluctuations/particles – this is called preheating/heating.\n\nthere is a long rad dominated period, relativistic quarks and gluons as well as photons and electrons and positrons and neutrinos and antineutrinos. the quarks and gluons combine into pions etc and protons and neutrons during the hadronization era, which then becomes mostly photons and electrons and positrons and neutrinos and antineutrinos and nonrelativistic neutron and protons. then neutrinos decouple (keeping some entropy) and electrons and positrons combine into photons (absorbing the entropy of the  electrons and positrons, hence the photon temperature is higher than the neutrino temperature – redshifted 2.725 K cf. 1.93 K)\n\nthroughout all that evolution $\\zeta$ remains constant, carrying the imprint of the stochastic kicks that made it look the way it does – a nearly Gaussian random field.\n\nthis constant random field underlies all structure in the Universe, certainly in the linear phase, but also into the arbitrarily nonlinear there is memory of what the fluctuations that fave birth were like. hence a rather important field i would say."
    }
  ]
}